#include "Ве_крест_крест.h"

внедрить хутор Русь;

царь_батюшка_главный()
{
    вперёд_славяне; // Устанавливаем кодировку для вывода

    забор<целина> великие_года; // Создаем вектор для хранения великих лет

    // Добавляем великие года в вектор
    великие_года.вставить(великие_года.прекратить(), 862);
    великие_года.вставить(великие_года.прекратить(), 879);
    великие_года.вставить(великие_года.прекратить(), 988);
    великие_года.вставить(великие_года.прекратить(), 1015);

    // Выводим великие года
    для (целина год : великие_года)
    {
        молвить << "Великое лето " << год << прыг_скок;
    }

    воздать 0;
}